srisurya97/STM32F103C8T6-TFT-DISPlAY/keynav.c
#include "stm32f10x.h"
#include "MenuFramework.h"
#include "keynav.h"
#include "lcd.h"
#include "delay.h"
#include "ADC.h"

static uint8_t selectvals=2;

void interruptsettings(void)
{
	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;  //setting up alternate function for interrupts
	EXTI->RTSR |= (EXTI_RTSR_TR0 | EXTI_RTSR_TR1 | EXTI_RTSR_TR2); //rising edge trigger
	AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI0_PA; //setting up interrupt for lineport A0
	AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI1_PA; //setting up interrupt for lineport A1
  AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI2_PA;	//setting up interrupt for lineport A2	
}

void interruptenable(void)
{
	EXTI->IMR |= (EXTI_IMR_MR0 | EXTI_IMR_MR1 | EXTI_IMR_MR2); //enabling the interrupt for the line 0,1,2
	NVIC_EnableIRQ(EXTI0_IRQn);
	NVIC_EnableIRQ(EXTI1_IRQn);
  NVIC_EnableIRQ(EXTI2_IRQn);
}

void navsupport3key(void)
{
	//PIN A0 for Nav and A1 for Back and A2 for Select //PORT A PINS 2, 1 and 0 set to input pushpull
		//RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
		//RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
		GPIOA->CRL &= ~(GPIO_CRL_MODE0| GPIO_CRL_MODE1 | GPIO_CRL_MODE2);
		GPIOA->CRL |= (GPIO_CRL_CNF0_1|GPIO_CRL_CNF1_1 | GPIO_CRL_CNF2_1);
		GPIOA->CRL &= ~(GPIO_CRL_CNF0_0|GPIO_CRL_CNF1_0 |GPIO_CRL_CNF2_0);
		//interrupt related
		interruptsettings();
		interruptenable();
}

void choosenext (void)
{		
	 if(rem == 0) //Choose Next
			{
				uint8_t MAX = 4;  //Max Number of Menus
				move ++;
				if(move > MAX) 
					{
						move = MAX;
					}
				menuchoose(move);
				
			}
			else if (rem == 1 )
				{
					uint8_t MAX = 6;  //Max Number of Menus
					selectvals++;
					if(selectvals>MAX){selectvals=MAX;}
					if(selectvals==1 || selectvals==2)
						{
							selectXmark(selectvals);
							ONOFFSwitch(100,line3,0);
							ONOFFSwitch(100,line6,0);
							ONOFFSwitch(100,line9,0);
							ONOFFSwitch(100,line12,0);
						}	
						else
							{
								menuchoose(selectvals+4);
							}
				}
				else if (((rem == 2 )||(rem == 3 )||(rem == 4 )||(rem == 5 )||(rem == 6 )))
					{
						selectvals=2;
						selectXmark(selectvals);
					}
					else
						{

						}		
}

void selectingmenu(void)
{
	  if (rem == 0)   //Selecting the Submenu 
			{
				uint8_t MIN = 1;  //Don't Change
				uint8_t MAX = 4;  //Max Number of Menus
				rem= move;
			}
			else if (rem == 1 )
				{
					if(selectvals==1)
						{
							ADC1->CR2 &= ~ADC_CR2_ADON;
							selectvals=2;
							rem=100;
						}
					if(selectvals==3)
						{
							mode = 0;
							rem = 7;
						}
					if(selectvals==4)
						{
							mode = 1;
							rem = 8;
						}
					if(selectvals==5)
						{
							mode = 2;
							rem = 9;
						}
					if(selectvals==6)
						{
							mode = 2;
							rem = 10;
						}
				}
				else if (((rem == 2 )||(rem == 3 )||(rem == 4 )||(rem == 5 )||(rem == 6 ))) 
					{
						if(selectvals==1)
							{
								selectvals=2;
								rem=100;
							}
					}
					else
						{

						}	
}

void chooseprevious(void)
{
	if(rem == 0)
		{
			uint8_t MIN = 1;  //Don't Change
			move = move - 1;
			if(move < MIN) 
				{
					move = 1;
				}
			menuchoose(move);		//Chooses SubMenu	 
		}
		else if (rem == 1 )
			{
				uint8_t MIN = 1;
				selectvals--;
				if(selectvals<MIN){selectvals=MIN;}				
    		if(selectvals==1 || selectvals==2)
					{
						selectXmark(selectvals);
						ONOFFSwitch(100,line3,0);
						ONOFFSwitch(100,line6,0);
						ONOFFSwitch(100,line9,0);
					}
					else
						{
							menuchoose(selectvals+4);
						}				
			}
			else if ((rem == 2 )||(rem == 3 )||(rem == 4 )||(rem == 5 )||(rem == 6 ))
				{
					selectvals=1;
					selectXmark(selectvals);
				}
				else if((rem == 7) || (rem == 8) || (rem == 9) || (rem == 10))
					{
						ADC1->CR2 &= ~ADC_CR2_ADON;
						rem=1;
						selectvals=2;
					}
					else 
						{
					
						
						}		
}

void EXTI0_IRQHandler(void)
 {
	 EXTI->PR |= EXTI_PR_PR0;
	 static uint8_t debounce=0;
	 debounce++;
	 if(debounce ==2) { debounce=0;	choosenext();}
 }

 void EXTI1_IRQHandler(void)
 {
	 EXTI->PR |= EXTI_PR_PR1;
	 static uint8_t debounce=0;
	 debounce++;
	 if(debounce ==2)	{ debounce=0; selectingmenu();}
 }
 
 void EXTI2_IRQHandler(void)
 {
	EXTI->PR |= EXTI_PR_PR2;
	static uint8_t debounce=0;
	 debounce++;
	 if(debounce ==2)	{debounce=0; chooseprevious();}
 }






